#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Reading...
module.single_zone.module.public_resources[0].aws_cloudfront_origin_access_control.website_origin_access_control: Refreshing state... [id=E3RNQ0V4MAIQ68]
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Reading...
module.single_zone.module.public_resources[0].aws_cloudfront_function.x_forwarded_host: Refreshing state... [id=vltech-website-x-forwarded-host-function]
module.single_zone.module.public_resources[0].data.aws_region.current: Reading...
module.http-redirect.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:615299762949:certificate/c69ccd6e-eece-4944-b5d5-e191ea5376aa]
module.single_zone.module.public_resources[0].aws_cloudfront_cache_policy.cache_policy[0]: Refreshing state... [id=06efa7e0-f0db-4669-832e-5b76036eb9b1]
module.single_zone.module.public_resources[0].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.single_zone.data.archive_file.image_optimisation_function[0]: Reading...
module.single_zone.data.archive_file.revalidation_function[0]: Reading...
module.single_zone.data.archive_file.revalidation_function[0]: Read complete after 0s [id=81fabff6fc0a543e0f12fce9e8c85412087510d1]
module.single_zone.data.archive_file.warmer_function[0]: Reading...
module.single_zone.data.archive_file.warmer_function[0]: Read complete after 0s [id=e5094e337d97bf663bebb451657f5785a9dda36d]
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Read complete after 0s [id=b689b0a8-53d0-40ab-baf2-68738e2966ac]
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Reading...
module.single_zone.module.image_optimisation_function[0].aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-image-optimization-function-role]
module.single_zone.aws_sqs_queue.revalidation_queue: Refreshing state... [id=https://sqs.eu-central-1.amazonaws.com/615299762949/vltech-website-isr-queue.fifo]
module.single_zone.aws_s3_bucket.bucket[0]: Refreshing state... [id=vltech-website-website-bucket]
module.single_zone.aws_dynamodb_table.isr_table[0]: Refreshing state... [id=vltech-website-isr-tag-mapping]
module.http-redirect.data.aws_route53_zone.zone: Reading...
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Reading...
module.single_zone.module.revalidation_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-revalidation-function-role]
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.http-redirect.aws_cloudfront_function.redirect: Refreshing state... [id=http-redirect]
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.server_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-server-function-role]
module.http-redirect.data.aws_route53_zone.zone: Read complete after 0s [id=Z01305181G23H04WP32YA]
module.single_zone.module.revalidation_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-revalidation-function]
data.aws_caller_identity.current: Reading...
module.single_zone.module.open_next_aliases[0].aws_ssm_parameter.origin_aliases: Refreshing state... [id=vltech-website-website-origin-aliases]
module.single_zone.data.aws_region.current: Reading...
module.single_zone.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.server_function.data.aws_caller_identity.current: Reading...
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 1s [id=615299762949]
module.single_zone.module.revalidation_function.data.aws_region.current: Reading...
module.single_zone.module.revalidation_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.server_function.data.aws_region.current: Reading...
module.single_zone.module.server_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.server_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-server-function]
module.single_zone.data.archive_file.image_optimisation_function[0]: Read complete after 1s [id=2b4ba037e3c53597e13efec875df025c9140263d]
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Reading...
module.single_zone.module.server_function.data.aws_caller_identity.current: Read complete after 1s [id=615299762949]
module.single_zone.module.image_optimisation_function[0].aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-image-optimization-function]
module.http-redirect.aws_route53_record.cert_validation["victorlevasseur.tech"]: Refreshing state... [id=Z01305181G23H04WP32YA__abc41aced5334d86bdd43adac171c372.victorlevasseur.tech._CNAME]
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Read complete after 0s [id=Z01305181G23H04WP32YA]
module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-revalidation-function]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Read complete after 1s [id=615299762949]
module.http-redirect.aws_acm_certificate_validation.cert: Refreshing state... [id=2025-02-13 14:11:52.205 +0000 UTC]
module.http-redirect.aws_cloudfront_distribution.distribution: Refreshing state... [id=E3AXV12PY17NPX]
module.single_zone.module.revalidation_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-revalidation-function-lambda-policy]
module.http-redirect.aws_route53_record.main["victorlevasseur.tech"]: Refreshing state... [id=Z01305181G23H04WP32YA_victorlevasseur.tech_A]
module.single_zone.module.revalidation_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-revalidation-function-role-20241218205629363600000001]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Reading...
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Read complete after 0s [id=vltech-website-website-origin-aliases]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/apple-icon.png/route"]: Refreshing state... [id=58a85337-4964-a471-0698-593fc2d27dbb]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/_not-found"]: Refreshing state... [id=add62efc-9114-a84d-fe55-0da9e9cc87a0]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/icon.svg/layout"]: Refreshing state... [id=6b3e9d83-e8c4-ea31-27d1-8258d4e32173]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/favicon.ico"]: Refreshing state... [id=4272fe26-7002-b04c-708d-40a9f581c4d2]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/cgv"]: Refreshing state... [id=c71e4d1a-a6a2-0643-9f2e-eab42f4d0861]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/_not-found/layout"]: Refreshing state... [id=7ff8f7c6-2521-cc60-9b77-e70ab7a1d2f7]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/index"]: Refreshing state... [id=6ffd2527-2ca7-3394-c872-7716f5d9a251]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/cgv/layout"]: Refreshing state... [id=95d26d47-67c8-1b11-518c-d86bc6ac5a1d]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/apple-icon.png/layout"]: Refreshing state... [id=708059f6-db46-e7a1-5fc1-614d09ea6ea9]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/apple-icon.png"]: Refreshing state... [id=ef6e016b-5c69-fef8-a8e8-0a025cb28eca]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/icon.svg"]: Refreshing state... [id=d32714ca-8481-bea8-1448-2b60d3895f79]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/sitemap.xml/layout"]: Refreshing state... [id=7062db69-79e1-5b43-2a74-c1eafda394d6]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/icon.svg"]: Refreshing state... [id=56a33db4-ca2c-57c8-bb37-a6dde565f37e]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/page"]: Refreshing state... [id=62d39a62-7fcd-1da6-959b-2e25ce864381]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/favicon.ico"]: Refreshing state... [id=fe8119a2-0843-9f28-1b66-353bbb77503b]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/_not-found/page"]: Refreshing state... [id=98e524b4-9931-2843-efd2-90433c84ff51]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/cgv"]: Refreshing state... [id=164e9879-535c-f7da-8ea0-edc8c60745d8]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/favicon.ico/route"]: Refreshing state... [id=41071cf5-213a-6cea-0679-399f4be1d727]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/"]: Refreshing state... [id=ba9f652d-2468-23e4-2839-64bc857f49cd]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/favicon.ico/layout"]: Refreshing state... [id=8d24733c-a6d3-6f7f-5602-0f6bf069bfa7]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/sitemap.xml/route"]: Refreshing state... [id=c04d99b9-e602-eb3c-7a4e-d86c7eac1a74]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/_not-found"]: Refreshing state... [id=59b38eb1-f1a9-0e9d-6d71-5fc34b6e9eaa]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/sitemap.xml"]: Refreshing state... [id=ac902782-236a-2642-dc29-d9f0615bdf38]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/apple-icon.png"]: Refreshing state... [id=1d5e3d52-6a97-2b6f-9f80-31500d490ea8]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/cgv/page"]: Refreshing state... [id=748fbb2d-92d3-8763-ab17-0c837692c71f]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/sitemap.xml"]: Refreshing state... [id=2e48a942-e536-065c-25a5-2f8cfaa7f158]
module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/icon.svg/route"]: Refreshing state... [id=7998961c-3e6e-ef24-f175-f69ee6ff0595]
module.single_zone.module.revalidation_function.aws_lambda_alias.lambda_alias["stable"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:stable]
module.single_zone.aws_lambda_event_source_mapping.revalidation_queue_source: Refreshing state... [id=23604771-f7d2-432b-ba67-c4d45c3c7817]
module.single_zone.module.revalidation_function.terraform_data.update_alias[0]: Refreshing state... [id=dcf09cf1-97a5-b524-50b5-4fdd732d74aa]
module.single_zone.module.revalidation_function.aws_lambda_function_url.function_url["stable"]: Refreshing state... [id=vltech-website-revalidation-function/stable]
module.single_zone.module.image_optimisation_function[0].aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-image-optimization-function-lambda-policy]
module.single_zone.module.server_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-server-function-lambda-policy]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-image-optimization-function]
module.single_zone.data.archive_file.server_function[0]: Reading...
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/4bd1b696-c579319bb9b05615.js"]: Refreshing state... [id=ac913217-a6e6-32d9-66ab-7bca99b23029]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9f05b6a2725a7318-s.woff2"]: Refreshing state... [id=ac4a618e-66ed-1415-d02d-9d88a4c281ad]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/cgv/page-2f9874ecc3099b18.js"]: Refreshing state... [id=34f45cf6-bb8a-9b44-d95d-0c917d12f956]
module.single_zone.module.s3_assets.terraform_data.file_sync["0WcRHCi6lpTODKozVxIRB/apple-icon.png.cache"]: Refreshing state... [id=fd0b62a6-9758-5c89-6701-e7af57450360]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/0WcRHCi6lpTODKozVxIRB/_ssgManifest.js"]: Refreshing state... [id=78c2d206-dc07-ce37-9833-bee134bffeb3]
module.single_zone.module.s3_assets.terraform_data.file_sync["0WcRHCi6lpTODKozVxIRB/_not-found.cache"]: Refreshing state... [id=0870ff5a-2757-69e4-9736-48c62beaf5d1]
module.single_zone.module.s3_assets.terraform_data.file_sync["0WcRHCi6lpTODKozVxIRB/cgv.cache"]: Refreshing state... [id=f39062ae-8b28-45cf-cd07-d7d74da95020]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_app-d23763e3e6c904ff.js"]: Refreshing state... [id=a0a95740-9bd1-bbc5-3088-e6e5d18fff57]
module.single_zone.module.s3_assets.terraform_data.file_sync["0WcRHCi6lpTODKozVxIRB/500.cache"]: Refreshing state... [id=10086609-597c-f921-96d2-317bbc7f2452]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/d0697bdd3fb49a78-s.woff2"]: Refreshing state... [id=9076105b-745e-e65e-ec39-f64e126aac2e]
module.single_zone.module.s3_assets.terraform_data.file_sync["0WcRHCi6lpTODKozVxIRB/sitemap.xml.cache"]: Refreshing state... [id=e97d1dd5-24ac-3a56-e3ed-76dd60e85286]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-8afb5c88d2340613.js"]: Refreshing state... [id=466372c9-168c-2f72-f31f-51cac8590e83]
module.single_zone.module.s3_assets.terraform_data.file_sync["0WcRHCi6lpTODKozVxIRB/favicon.ico.cache"]: Refreshing state... [id=a6f7a0f8-743a-bf16-d22b-1806ba7f3ce2]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/357398c3a461852b-s.woff2"]: Refreshing state... [id=e42276e7-9c0c-c131-fdcf-2a5abf5f7666]
module.single_zone.module.s3_assets.terraform_data.file_sync["assets/vltech_logo.png"]: Refreshing state... [id=5580fd80-287a-0715-aa66-6da5c311462b]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/c740c1d45290834f-s.woff2"]: Refreshing state... [id=6c695a5c-d238-b55a-e737-abff99fcd32c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-app-d4c84837250c81b8.js"]: Refreshing state... [id=fbe0b5a6-0ff9-f248-fb8d-1f39b44a8105]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/7bafef50a4560c1d-s.woff2"]: Refreshing state... [id=271e32ae-abf0-ca24-a29d-49260817d15a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/webpack-984cbc839a680ab5.js"]: Refreshing state... [id=0326f31c-3e63-6c97-3dcd-1937ad8c78fc]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/layout-dbf93d4b3b66ee0d.js"]: Refreshing state... [id=f70e794e-46fc-f612-0b45-1bcaab0b96a8]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/978-2e23e15eb2d9825e.js"]: Refreshing state... [id=08c3e02a-0a97-2c74-2cfe-bc127cd57f15]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/_not-found/page-b2447a23980919fd.js"]: Refreshing state... [id=86b17e9c-0ff0-125e-e384-6bbaf9c2d977]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/b8022cc0231a4bfd.css"]: Refreshing state... [id=715e82b9-4752-4d03-4e14-bba9b5b369bd]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/42aa6e6ea3b85651-s.woff2"]: Refreshing state... [id=59d3c0ee-ae3d-7390-a731-81f5168d647a]
module.single_zone.module.s3_assets.terraform_data.file_sync["0WcRHCi6lpTODKozVxIRB/index.cache"]: Refreshing state... [id=bc9c9fca-22cb-1289-f892-13bdb8fd1d49]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/page-b5896372898a26b5.js"]: Refreshing state... [id=bc9d1baf-5248-765c-dec3-717d504374f3]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/polyfills-42372ed130431b0a.js"]: Refreshing state... [id=83abb4c2-13d6-9782-a9c9-1f886e23d3a1]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/b32bc20a1e277f31-s.woff2"]: Refreshing state... [id=321d4549-ae06-3830-42eb-cfce7a6e73cf]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/173-fc558b54b5be890b.js"]: Refreshing state... [id=bae8c547-8fd3-1d15-a8aa-1e2e1fb9c4d5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/0WcRHCi6lpTODKozVxIRB/_buildManifest.js"]: Refreshing state... [id=c9f67712-208d-2875-38a0-65e50028f080]
module.single_zone.module.s3_assets.terraform_data.file_sync["0WcRHCi6lpTODKozVxIRB/icon.svg.cache"]: Refreshing state... [id=cae97467-7a2d-d455-f0f5-aea56e923276]
module.single_zone.module.s3_assets.terraform_data.file_sync["documents/cgv.pdf"]: Refreshing state... [id=c76dce72-1386-d74a-4047-b8fa9d7b4f05]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/bc270b3a577192a7-s.woff2"]: Refreshing state... [id=16b8f0c3-94b5-168f-1fc9-f51adc0e8a3c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/a8eac78432f0a60b-s.woff2"]: Refreshing state... [id=9e031051-5705-f03c-c644-4ca8b9261bf5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_error-9b7125ad1a1e68fa.js"]: Refreshing state... [id=75ef6842-85f2-603c-3c4b-cd67c9b9561f]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/framework-a6eb4bce5bd8ed9b.js"]: Refreshing state... [id=2e38b1f6-e9cc-8645-2869-3d55b50564e3]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/01b81fc6c4002686.css"]: Refreshing state... [id=de26967e-7b67-5a54-f6e4-3b45a00acb1c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/4d1af68a2715a16a-s.p.woff2"]: Refreshing state... [id=e72e9c33-e3f8-1fde-1eb0-6a73205452e8]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/122c360d7fe6d395-s.p.woff2"]: Refreshing state... [id=674ad872-ee9b-89bd-9252-351607ab6caf]
module.single_zone.module.s3_assets.terraform_data.file_sync["favicon.ico"]: Refreshing state... [id=d538d61d-dce0-cc44-df24-44711711892d]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9bbb7f84f3601865-s.woff2"]: Refreshing state... [id=325d0d9e-b078-18a5-55c7-a53c90d5c6d5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/517-47d8fb00497672e4.js"]: Refreshing state... [id=a6a618da-575c-c65c-ffec-d19aeebed804]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/382b6f43e60580be-s.woff2"]: Refreshing state... [id=02cd3ae0-21e8-4118-e990-2aebe2360167]
module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"]: Refreshing state... [id=4e58123a-787e-9706-16b1-f6fae8948558]
module.single_zone.module.server_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-server-function-role-20241218205750451600000001]
module.single_zone.module.image_optimisation_function[0].aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-image-optimization-function-role-20241218205750570200000002]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:opennext]
module.single_zone.module.image_optimisation_function[0].aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205755531800000003]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:nextjs]
module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0]: Refreshing state... [id=6739ecd4-7829-e1e3-fe1d-9029599ee1a7]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-image-optimization-function/opennext]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-image-optimization-function/nextjs]
module.single_zone.data.archive_file.server_function[0]: Read complete after 1s [id=f336b492b9c4ac2e1d9e437d97657094dd0f63f6]
module.single_zone.module.server_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-server-function]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:opennext]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:nextjs]
module.single_zone.module.server_function.aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205803707400000004]
module.single_zone.module.server_function.terraform_data.update_alias[0]: Refreshing state... [id=cd9525ee-d1d6-2653-2fc5-9dd426207b1e]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-server-function/opennext]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-server-function/nextjs]
module.single_zone.module.public_resources[0].aws_cloudfront_distribution.production_distribution[0]: Refreshing state... [id=EU3DKQFOTEI79]
module.single_zone.module.public_resources[0].aws_route53_record.route53_a_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_A]
module.single_zone.module.public_resources[0].aws_route53_record.route53_aaaa_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_AAAA]
module.single_zone.terraform_data.update_aliases[0]: Refreshing state... [id=49c58d79-1f33-2d00-f3ea-d2bf33d20bfb]
module.single_zone.aws_s3_bucket_policy.bucket_policy[0]: Refreshing state... [id=vltech-website-website-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "ba9f652d-2468-23e4-2839-64bc857f49cd" -> null
      - triggers_replace = [
          - "nextjs",
          - "0a46edffe490b5f749098b3e724d3d46",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/_not-found"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "59b38eb1-f1a9-0e9d-6d71-5fc34b6e9eaa" -> null
      - triggers_replace = [
          - "nextjs",
          - "730822ed3db583d922c68a71fc3891a4",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/_not-found/layout"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/_not-found/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "7ff8f7c6-2521-cc60-9b77-e70ab7a1d2f7" -> null
      - triggers_replace = [
          - "nextjs",
          - "091acf53897140d982130d9a4cead726",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/_not-found/page"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/_not-found/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "98e524b4-9931-2843-efd2-90433c84ff51" -> null
      - triggers_replace = [
          - "nextjs",
          - "a2719a552fb0b2c0e5fb59f4e26672d3",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/apple-icon.png"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "1d5e3d52-6a97-2b6f-9f80-31500d490ea8" -> null
      - triggers_replace = [
          - "nextjs",
          - "be739d48c3f99ac8c19cbf07f3ab36b0",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/apple-icon.png/layout"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/apple-icon.png/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "708059f6-db46-e7a1-5fc1-614d09ea6ea9" -> null
      - triggers_replace = [
          - "nextjs",
          - "d68e36fab783fa93e67b68025ee23fd6",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/apple-icon.png/route"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/apple-icon.png/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "58a85337-4964-a471-0698-593fc2d27dbb" -> null
      - triggers_replace = [
          - "nextjs",
          - "1066d37e089ee350a5aa7bf540193db1",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/cgv"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/cgv"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "164e9879-535c-f7da-8ea0-edc8c60745d8" -> null
      - triggers_replace = [
          - "nextjs",
          - "21e9a2d81a9ee8005f58e41aa9367f00",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/cgv/layout"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/cgv/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "95d26d47-67c8-1b11-518c-d86bc6ac5a1d" -> null
      - triggers_replace = [
          - "nextjs",
          - "0aeada98b205d6a94564dff67a139d83",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/cgv/page"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/cgv/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "748fbb2d-92d3-8763-ab17-0c837692c71f" -> null
      - triggers_replace = [
          - "nextjs",
          - "3f9cfd97b350737f6c9e7c9fbb45946f",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/favicon.ico"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "fe8119a2-0843-9f28-1b66-353bbb77503b" -> null
      - triggers_replace = [
          - "nextjs",
          - "9a2a6dabeaa9283e7552a055a5b190f3",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/favicon.ico/layout"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/favicon.ico/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "8d24733c-a6d3-6f7f-5602-0f6bf069bfa7" -> null
      - triggers_replace = [
          - "nextjs",
          - "e9cfc5e5a79e6425f4a312fd752a9a0f",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/favicon.ico/route"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/favicon.ico/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "41071cf5-213a-6cea-0679-399f4be1d727" -> null
      - triggers_replace = [
          - "nextjs",
          - "fd36ea920720caa9bf9c9f3bbfe781fc",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/icon.svg"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "56a33db4-ca2c-57c8-bb37-a6dde565f37e" -> null
      - triggers_replace = [
          - "nextjs",
          - "9392c3be9b4e0d0895bbc66b61db5610",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/icon.svg/layout"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/icon.svg/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "6b3e9d83-e8c4-ea31-27d1-8258d4e32173" -> null
      - triggers_replace = [
          - "nextjs",
          - "ac4cea1da86dafc703382e2837b7abe4",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/icon.svg/route"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/icon.svg/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "7998961c-3e6e-ef24-f175-f69ee6ff0595" -> null
      - triggers_replace = [
          - "nextjs",
          - "c59939a0b4d2d77ef5b19b9865f886cb",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/_not-found"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "add62efc-9114-a84d-fe55-0da9e9cc87a0" -> null
      - triggers_replace = [
          - "nextjs",
          - "17a9d452bfb0423c511432fbe901c528",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/apple-icon.png"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "ef6e016b-5c69-fef8-a8e8-0a025cb28eca" -> null
      - triggers_replace = [
          - "nextjs",
          - "6d314e9754ecee409183d45edd183060",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/cgv"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/cgv"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "c71e4d1a-a6a2-0643-9f2e-eab42f4d0861" -> null
      - triggers_replace = [
          - "nextjs",
          - "b34b0652c287c46833e6ea1a00f034c7",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/favicon.ico"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "4272fe26-7002-b04c-708d-40a9f581c4d2" -> null
      - triggers_replace = [
          - "nextjs",
          - "2b3d252a5e309db649cbe2a52e36d10a",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/icon.svg"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "d32714ca-8481-bea8-1448-2b60d3895f79" -> null
      - triggers_replace = [
          - "nextjs",
          - "5e602538e685c6484cea6d503ecc9e6a",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/index"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/index"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "6ffd2527-2ca7-3394-c872-7716f5d9a251" -> null
      - triggers_replace = [
          - "nextjs",
          - "3e9a69e3532913d857887427b10afd36",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/sitemap.xml"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/layout-0WcRHCi6lpTODKozVxIRB/sitemap.xml"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "2e48a942-e536-065c-25a5-2f8cfaa7f158" -> null
      - triggers_replace = [
          - "nextjs",
          - "f7c9d89295f17a7ac9ca08436cbd0407",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/page"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "62d39a62-7fcd-1da6-959b-2e25ce864381" -> null
      - triggers_replace = [
          - "nextjs",
          - "47e2ea9641419bcff1f8ea266b365823",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/sitemap.xml"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/sitemap.xml"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "ac902782-236a-2642-dc29-d9f0615bdf38" -> null
      - triggers_replace = [
          - "nextjs",
          - "a775abe8633c64049e6a0f5098972330",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/sitemap.xml/layout"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/sitemap.xml/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "7062db69-79e1-5b43-2a74-c1eafda394d6" -> null
      - triggers_replace = [
          - "nextjs",
          - "65715746bb9513835c16e8f89f3441fe",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["0WcRHCi6lpTODKozVxIRB/_N_T_/sitemap.xml/route"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_N_T_/sitemap.xml/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "c04d99b9-e602-eb3c-7a4e-d86c7eac1a74" -> null
      - triggers_replace = [
          - "nextjs",
          - "de236beced24c7844e389fcf613951dc",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "0800de44bf7645ba991d9c890d630f56",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "1a71bbb2b6da24bb6be486bd788f7584",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/_not-found/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "2154dc675be2b4c86cce3089a46c6d87",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/_not-found/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "afc204823d7803790bb5ec4e45f7d732",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/apple-icon.png"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "3d4879f0d3012a791d918f78e884fddb",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/apple-icon.png/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "1eb78fb75bfc5d92bca9f0d8a580789a",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/apple-icon.png/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "1787a184f97b16dd071bf3abea1dc73a",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/cgv"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "a426a9d8e080d3da60404a542f9ec0f6",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/cgv/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "afddf902b226b69f2729e3a6a0f902a9",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/cgv/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "51054a91fcde2525a1f801b2230d431c",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "eb344bdabcf4e8fb13c228f616c481b7",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/favicon.ico/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "5f579fafc56593ab61f4ea9e43d36460",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/favicon.ico/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "4d06206d84625bbc9f59022584e05982",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/icon.svg"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "f523c32e9db16599a8640036aa05f08d",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/icon.svg/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "104699b189326bf76d9924cc82094b7b",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/icon.svg/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "fc195c3181702816677ece9b1953363a",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/layout-ma216esfExRvecRGeC1PB/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "eddc13b32aed4b5f2803f1e15dc94c53",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/layout-ma216esfExRvecRGeC1PB/apple-icon.png"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "57796030c520efe04de61a080d581d88",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/layout-ma216esfExRvecRGeC1PB/cgv"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "e1c27deaae910667188652e3d8454a55",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/layout-ma216esfExRvecRGeC1PB/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "1afeb94c374f85efa66c47ed03a21cf7",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/layout-ma216esfExRvecRGeC1PB/icon.svg"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "092856256d5d53453ac14fd862785eeb",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/layout-ma216esfExRvecRGeC1PB/index"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "e202da7892f2da2816a91f1b0a566138",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/layout-ma216esfExRvecRGeC1PB/sitemap.xml"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "c4ad8782a5fe3cb826166f32a568a814",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "4d213e3f45d856c21e3628cc5a0a315c",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/sitemap.xml"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "051ebd0fa84f5eff392533cf116cb47b",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/sitemap.xml/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "5abc199ce8f6f410278b1f13e838c5d4",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["ma216esfExRvecRGeC1PB/_N_T_/sitemap.xml/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "14b6d66a0ca71321cc6a98374cbcea44",
        ]
    }

  # module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-image-optimization-function"
      ~ last_modified                  = "2025-02-24T15:45:19.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:22" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:22/invocations" -> (known after apply)
      ~ source_code_hash               = "iL212wJnzKU59XczQRYy7nsW91j8+R+RLZtvDcxuues=" -> "S50nBnOMa3aV/E6EWZ96tWxQAqAJ0DREH+o+Qe7I0KE="
        tags                           = {}
      ~ version                        = "22" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "6739ecd4-7829-e1e3-fe1d-9029599ee1a7" -> (known after apply)
      ~ triggers_replace = [
          ~ "22" -> (known after apply),
            "nextjs",
        ]
    }

  # module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-revalidation-function"
      ~ last_modified                  = "2025-02-24T15:45:07.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:22" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:22/invocations" -> (known after apply)
      ~ source_code_hash               = "9lw0WIvJjZ2CxQq6SUrSMRkSXNI2EFWabKBWO+TI1nE=" -> "higZmmeKRLTK3t6yvgV6OUR8GUTCKrBkkBb5Lv+qxfM="
        tags                           = {}
      ~ version                        = "22" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.single_zone.module.revalidation_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "dcf09cf1-97a5-b524-50b5-4fdd732d74aa" -> (known after apply)
      ~ triggers_replace = [
          ~ "22" -> (known after apply),
            "stable",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["0WcRHCi6lpTODKozVxIRB/500.cache"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/500.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "10086609-597c-f921-96d2-317bbc7f2452" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "6f0e590f8615bf77da0c45585959a56d",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["0WcRHCi6lpTODKozVxIRB/_not-found.cache"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/_not-found.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "0870ff5a-2757-69e4-9736-48c62beaf5d1" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "0e85360f3b82de94fa75aeba7bff8f72",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["0WcRHCi6lpTODKozVxIRB/apple-icon.png.cache"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/apple-icon.png.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "fd0b62a6-9758-5c89-6701-e7af57450360" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9843a61c98627e227286769373becd10",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["0WcRHCi6lpTODKozVxIRB/cgv.cache"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/cgv.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "f39062ae-8b28-45cf-cd07-d7d74da95020" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "a0b9584de682af471f5334089e205e68",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["0WcRHCi6lpTODKozVxIRB/favicon.ico.cache"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/favicon.ico.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "a6f7a0f8-743a-bf16-d22b-1806ba7f3ce2" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "1253a11e7fded511c766a255028ab4ee",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["0WcRHCi6lpTODKozVxIRB/icon.svg.cache"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/icon.svg.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "cae97467-7a2d-d455-f0f5-aea56e923276" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "31e8b96a370a0c0409d732d5d9c1d2d6",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["0WcRHCi6lpTODKozVxIRB/index.cache"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/index.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "bc9c9fca-22cb-1289-f892-13bdb8fd1d49" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "81abe6eca3b77c6bcefbbc9d6a9b7450",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["0WcRHCi6lpTODKozVxIRB/sitemap.xml.cache"] will be destroyed
  # (because key ["0WcRHCi6lpTODKozVxIRB/sitemap.xml.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "e97d1dd5-24ac-3a56-e3ed-76dd60e85286" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "f0c044fe0b3aba838c2df1383aa159b6",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"] must be replaced
-/+ resource "terraform_data" "file_sync" {
      ~ id               = "4e58123a-787e-9706-16b1-f6fae8948558" -> (known after apply)
      ~ triggers_replace = [
            # (1 unchanged element hidden)
            "nextjs",
          ~ "acfa934b28c012d7818fd421be8ffd47" -> "3279ba4385d41654eb88a66666adf146",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/0WcRHCi6lpTODKozVxIRB/_buildManifest.js"] will be destroyed
  # (because key ["_next/static/0WcRHCi6lpTODKozVxIRB/_buildManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "c9f67712-208d-2875-38a0-65e50028f080" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9a9bc883f7801dfd30597cebfafa30d0",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/0WcRHCi6lpTODKozVxIRB/_ssgManifest.js"] will be destroyed
  # (because key ["_next/static/0WcRHCi6lpTODKozVxIRB/_ssgManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "78c2d206-dc07-ce37-9833-bee134bffeb3" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "b404e23d62d95bafd03ad7747cc0e88b",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/ma216esfExRvecRGeC1PB/_buildManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9a9bc883f7801dfd30597cebfafa30d0",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/ma216esfExRvecRGeC1PB/_ssgManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "b404e23d62d95bafd03ad7747cc0e88b",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["ma216esfExRvecRGeC1PB/500.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "b8cb66f172d2c5791559133f44dea566",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["ma216esfExRvecRGeC1PB/_not-found.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "d369983ab4f8b6f9408ef182c2d67196",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["ma216esfExRvecRGeC1PB/apple-icon.png.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9843a61c98627e227286769373becd10",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["ma216esfExRvecRGeC1PB/cgv.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "6ea97c78bb4cbf63427d1fa2e772963d",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["ma216esfExRvecRGeC1PB/favicon.ico.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "1253a11e7fded511c766a255028ab4ee",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["ma216esfExRvecRGeC1PB/icon.svg.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "31e8b96a370a0c0409d732d5d9c1d2d6",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["ma216esfExRvecRGeC1PB/index.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "099bfb25c7df85531e14e0badc545e28",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["ma216esfExRvecRGeC1PB/sitemap.xml.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "95982f25f63d5fff73e7c0993ae28516",
        ]
    }

  # module.single_zone.module.server_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-server-function"
      ~ last_modified                  = "2025-02-24T15:45:31.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:22" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:22/invocations" -> (known after apply)
      ~ source_code_hash               = "N61GrRJQ0RhLKMdeBgcxVMi2mSui6H3FGPUE70TYrns=" -> "0Of5KQOUmbptAVo4kZzxXug8/f9c+JpyI6Z+pjp/abI="
        tags                           = {}
      ~ version                        = "22" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.server_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "cd9525ee-d1d6-2653-2fc5-9dd426207b1e" -> (known after apply)
      ~ triggers_replace = [
          ~ "22" -> (known after apply),
            "nextjs",
        ]
    }

Plan: 41 to add, 3 to change, 41 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Working Directory: `terraform`, Workflow: `PR Checks`*